#include <iostream>
#include <string>
#include <fstream> // подключаем библиотеку
using namespace std;
 
// https://youtu.be/jCW2wRoRi0U
// https://youtu.be/aUP0eAEIxog


// int main()
// {
// 	string s;
	
//  	ifstream file; // создаем объект класса ifstream
//  	file.open("/Users/sergejhorisenko/Desktop/text.txt"); // открываем файл
 	

//  	// Открытие файла в конструкторе выглядит так

//  	ifstream file ("/Users/sergejhorisenko/Desktop/text.txt"); // открываем файл в конструкторе



// //==================================================================//



//  	// вариант проверки с использованием метода is_open() :

//  	ifstream file ("d:\\1\\файл.txt");
 
// 	 if (file.is_open()) 								// вызов метода is_open()
// 	 	cout << "Все ОК! Файл открыт!\n\n" << endl;
// 	 else {
// 	 	cout << "Файл не открыт!\n\n" << endl;
// 	 	return -1;
// 	 }


// //==================================================================//

// 	 // Оператор считывания >>


	
// 	string s;
	 
// 	file >> s;



// //==================================================================//


// 	 // Считка слов из файла

// 	 for(file >> s; !file.eof(); file >> s) 
// 	        cout << s << endl;



// //==================================================================//

// 	 // Методы getline() и get()


// 	 C++

// 	//Считка строки из текста

// 	string s; 
// 	getline(file,s); 
// 	cout << s << endl;


// 	 int n = 10;

// 	//Создаем буффер для чтения
// 	 char* buffer = new char[n+1];
// 	        buffer[n]=0;

// 	//Читаем n символов
// 	 file.get(buffer,n);

// 	//Или так, но до первого пробела
// 	 file.getline(buffer,n,' ');

// 	//выводим считанное
// 	 cout << buffer;
	 
// 	//Освобождаем буффер
// 	 delete [] buffer;


// //==================================================================//

// 	// Метод read()


// 	  int n = 10;

// 	//Создаем буффер
// 	 char* buffer = new char[n+1]; buffer[n] = 0;

// 	//Читаем в него байты
// 	 file.read(buffer,n);

// 	//выводим их на экран
// 	 cout<<buffer;
// 	 delete [] buffer;



// //==================================================================//
// 	// Метод seekg()


// 	file.seekg(0,ios_base::end); 	//Стать в конец файла
// 	file.seekg(10,ios_base::end); 	//Стать на 10 байтов с конца
// 	file.seekg(30,ios_base::beg); 	//Стать на 31-й байт
// 	file.seekg(3,ios_base::cur); 	//перепрыгнуть через 3 байта
// 	file.seekg(3); 					//перепрыгнуть через 3 байта - аналогично



// //==================================================================//
// 	// Метод tellg()

// 	cout << "Считано байт: " << file.tellg();


// 	//становимся в конец файла
// 	 file.seekg(0,ios_base::end);

// 	//Получаем текущую позицию
// 	 cout << "Размер файла (в байтах): " << file.tellg();

	 



